# แก้สมการ y = 2x^2 + 2x + 1 เมื่อ x คือค่าที่รับทางแป้นพิมพ์ และแสดงผลจากการแก้สมการy ที่ได้ทางหน้าจอ
#1.รับค่าตัวเลขทางแป้นพิมพ์ 2.คำนวณสมการ 3.แสดงผลจาการคำนวณทางหน้าจอ 4.แสดงชื่อโปรแกรมทางหน้าจอ

def inputData( ) :
    x=int(input('โปรดป้อนค่าx : '))
    return x

def calFunction (x) :
    y=2*x*2+2*x+1
    return y

def showCalFunction ( ) :
    print(f'ค่าxที่คุณป้อนคือ {x} ')
    print(f'y=2*{x}*2+2*{x}+1 ')
    print(f'ค่าyของสมการคือ {y} ')
    print('**----------------------------------------------**')

def showProgramName( ) :
    print('**----------------------------------------------**')
    print('**-------------โปรแกรมคำนวณสมการ----------------**')
    print('**----------------------------------------------**')

x=inputData( )
y=calFunction(x)
showProgramName( )
showCalFunction( )
