#5. จงเขียนโปรแกรมPython ค านวนหาเงินเดือนสุทธิของพนักงาน แล้วแสดงผลทางหน้าจอ โดยรับค่ารหัสพนักงาน ชื อพนักงาน 
#และเงินเดือนปกติของพนักงานทางแป้นพิมพ์ ทั้งนี้เงินเดือนสุทธิของพนักงานนั้นจะต้องหักค่าภาษี 
#และเบี้ยประกันสังคมออกจากเงินเดือนปกติเสียก่อน โดยที พนักงานต้องเสียภาษี 7% ของเงินเดือนปกติ และจ่ายค่าเบี้ยประกันสังคม 500 บาท 
#สูตร เงินเดือนสุทธิ  =  เงินเดือนปกติ  -(เงินเดือนปกติ * 7 / 100) -500
#1.รับค่าข้อมูลพนักงานทางแป้นพิมพ์ 2.คำนวณเงินเดือนสุทธิ,ภาษีและเบี้ยประกันสังคม 3.แสดงผลการคำนวณทางหน้าจอ 4.แสดงชื่อโปรแกรมทางหน้าจอ

def inputData( ) :
    idWork = input('โปรดป้อนรหัสพนักงานของคุณ : ')
    name = input('โปรดป้อนชื่อของคุณ : ')
    salary = float(input('โปรดป้อนเงินเดือนของคุณ : '))
    return idWork,name,salary

def calSalary(salary) :
    netSalary =int(salary-(salary*7/100)-500)
    return netSalary

def showCalSalary( ) :
    print(f'รหัสพนักงานของคุณคือ {idwork}')
    print(f'ชื่อของคุณคือ {name}')
    print(f'เงินเดือนของคุณคือ {salary}')
    print(f'เงินสุทธิของคุณคือ {netSalary} บาท =เงินเดือน {salary} บาท, ภาษี {salary*7/100} บาท, เบี้ยประกัน 500 บาท')
    print('**----------------------------------------------**')

def showProgramName( ) :
    print('**----------------------------------------------**')
    print('**--------------โปรแกรมคำนวณเงินสุทธิ--------------**')
    print('**----------------------------------------------**')
     
idwork,name,salary=inputData( )
netSalary=calSalary(salary)
showProgramName( ) 
showCalSalary( )