#8. จงเขียนโปรแกรมPython ของโปรแกรมตรวจสอบค่า PH ของน้ าปะปาจากจังหวัดต่างๆ 
#โดยรับชื อจังหวัด และค่า PH ทางแป้นพิมพ์ และแสดงผลทางหน้าจอ โดยหากค่า PH เป็น 7-8 แสดงข้อความ "Result is Normal" 
#หากค่า PH มากกว่า 8 ให้แสดงข้อความ "Result is Acid" หากค่า PH น้อยกว่า 7 ให้แสดงข้อความ"Result is Alkali"
#1.รับค่าข้อมูลน้ำปะปาทางแป้นพิมพ์ 2.ตรวจสอบข้อมูลและแสดงผลทางหน้าจอ 3.แสดงชื่อโปรแกมทางหน้าจอ

def inputData( ) :
    name=input('โปรดป้อนชื่อจังหวัด : ')
    PH =int(input('โปรดป้อนค่าPH : '))
    return name,PH

def cheakPH(PH) :
    if PH <8 and PH >6 :
        print(f'จังหวัด {name}')
        print('Result is Normal')
        print('**---------------------------------------------**')
    elif PH >= 8 :
        print(f'จังหวัด {name}')
        print('Result is Acid')
        print('**---------------------------------------------**')
    else :
        print(f'จังหวัด {name}')
        print('Result is Alkali')
        print('**---------------------------------------------**')

def showProgramName( ):
    print('**---------------------------------------------**')
    print('**--โปรแกรมตรวจสอบค่า PH ของน้ำปะปาจากจังหวัดต่างๆ--**')
    print('**---------------------------------------------**')

name,PH =inputData( )
showProgramName( )
cheakPH(PH)