#7. จงเขียนโปรแกรมPython ของโปรแกรม Game Bingo โดยให้ผู้ใช้ป้อนตัวเลขที ต้องการทายทางแป้นพิมพ์ 
#แล้วให้โปรแกรมตรวจสอบว่าตรงกับที โปรแกรมก าหนดไว้หรือไม่ในที นี้คือ 25 
#หากไม่ตรงให้แสดงข้อความว่า "Not Correct !!!." ทางหน้าจอ หากตรงให้แสดงข้อความว่า "Correct, You are the winner
#1.รับค่าตัวเลขทางแป้นพิมพ์ 2.ตรวจสอบตัวเลขและแสดงผลตัวเลขทางหน้าจอ 4.แสดงชื่อของโปรแกรมทางหน้าจอ

def inputData( ) :
    number = int(input('โปรดใส่ตัวเลข : '))
    return number

def cheakNumber(number) :
    if number == 25 :
        print('Correct, You are the winner')
        print('**---------------------------------------------**')
    else :
        print('Not Correct !!!.')
        print('**---------------------------------------------**')

def showProgramName( ) :
    print('**---------------------------------------------**')
    print('**--------------Game Bingo---------------------**')
    print('**---------------------------------------------**')

number=inputData( )
showProgramName( )
cheakNumber(number)